import { Tplan } from "@/app/types/types";
import { makeId } from "@/app/utils/util";

export const plans :Tplan[]=[
    {   
        _id:'har123tiso213',
        type:'חופשי חודשי',
        price:350,
        desc:'תהנו ממנוי חודשי של יוגה ללא הגבלה',
        constraints:['כניסה ללא הגבלה לשיעורי הסטודיו','תוקף המנוי מתחיל עם השיעור הראשון','התוכנית מסתיימת לאחר לתקופת המנוי'],
    },
    {   
        _id:'e3d29a6x00ffa',
        type:'כרטיסייה 5 כניסות',
        price:250,
        desc:'תהנו ממנוי הכולל 5 כניסות לשיעורי הסטודיו',
        constraints:[' 5 כניסות במחיר של 250 ש"ח','המנוי תקף ל6 חודשים החל מהשיעור הראשון','אין חידוש אוטומטי בתום המנוי','המנוי כולל שעורים בסטודיו בלבד'],

    },
    {   
        _id:'pokdm1h2g3dss',
        type:'כרטיסייה 10 כניסות',
        price:450,
        desc:'תהנו ממנוי הכולל 10 כניסות לשיעורי הסטודיו',
        constraints:[' 10 כניסות במחיר של 450 ש"ח','המנוי תקף ל6 חודשים החל מהשיעור הראשון','אין חידוש אוטומטי בתום המנוי','המנוי כולל שעורים בסטודיו בלבד'],

    },
    {   
        _id:'1h2g3dss56sdv',
        type:'כניסה חד-פעמית',
        price:50,
        desc:'תהנו משיעור מתוך שיעורי הסטודיו',
        constraints:[],
    },
 ]