import { Tplan } from "@/app/types/types";
import { makeId } from "@/app/utils/util";

export const plans :Tplan[]=[
    {   
        _id:makeId(),
        type:'כניסה חד-פעמית',
        price:50,
        desc:'',
        constraints:[],
    },
    {   
        _id:makeId(),
        type:'כרטיסייה 5 כניסות ',
        price:250,
        desc:'תהנו ממנוי הכולל 5 כניסות לשיעורי הסטודיו',
        constraints:[' 5 כניסות במחיר של 250 ש"ח','המנוי תקף ל12 חודשים','אין חידוש אוטומטי בתום המנוי','המנוי כולל שעורים בסטודיו בלבד'],

    },
    {   
        _id:makeId(),
        type:'כרטיסייה 10 כניסות ',
        price:450,
        desc:'תהנו ממנוי הכולל 10 כניסות לשיעורי הסטודיו',
        constraints:[' 10 כניסות במחיר של 450 ש"ח','המנוי תקף ל12 חודשים','אין חידוש אוטומטי בתום המנוי','המנוי כולל שעורים בסטודיו בלבד'],

    },
    {   
        _id:makeId(),
        type:'חופשי חודשי',
        price:350,
        desc:'תהנו ממנוי חודשי של יוגה ללא הגבלה',
        constraints:['כניסה ללא הגבלה לשיעורי הסטודיו','המנוי מתחיל בביקור הראשון','התוכנית מסתיימת לאחר לתקופת המנוי'],
    },
 ]