import React from 'react'

type Props = {}

export default function page({}: Props) {
  return (
    <section className='studio-rules-contianer gc2'>
        <h1 className='tac p-1'>תקנון סטודיו קדם</h1>

<ol className='studio-rules flex-col gap05'>
            <li>
                   “כרטיסיה” או “מנוי חופשי חודשי” – התשלום ייגבה מראש.
הכרטיסיה מוגבלת בזמן (עד 6 חודשים מרגע רכישת הכרטיסייה) ובכניסות.
**לא ניתן לבטל כרטיסיה במהלכה.
            </li>
          
<li>

 תנאי המנוי – משתנים בהתאם לסוג המנוי, כפי שיפורסמו במועד ההרשמה.
הסטודיו רשאי לשינוי תנאי המנוי כמו גם העלאה של דמי המנוי , ובלבד שקיבלת הודעה מוקדמת של עשרה ימים לפחות לפני ביצוע החיוב.
</li>
<li>
 הקפאות – ניתן להקפיא מנוי מסיבה רפואית בצירוף אישור מרופא מומחה.
</li>
<li>
מצב בריאותי – האימון מותנה במילוי שאלון רפואי וחתימה על הצהרת בריאות או המצאת אישור רפואי מתאים, לפי הענין ובהתאם להוראות הדין. האחריות המלאה להמצאת האישור הרפואי חלה על החבר עצמו ועל חשבונו.בהעדר הצהרת בריאות או אישור רפואי מתאים, לא יתאפשר לחבר להתאמן. על החברים הסובלים מבעיות רפואיות, לרבות הסובלים מסוכרת, מחלות לב, לחץ דם גבוה או נמוך ו/או משתמשים בתרופות, לרבות תרופות הכוללות חומרים מונעי קרישה, אנטי היסטמינים וחוסמי בטא, להתייעץ עם רופא טרם הצטרפות לאימון.


</li>
<li>

 בכל מקרה של טענה על פציעה במהלך האימון, חובה עליו למלא דו“ח אירוע ולעדכן את המורה מיד.
</li>

<li>
 בשימוש במנוי, אתה מצהיר כי אתה מבין כי כל פעילות גופנית נושאת את הסיכון של פגיעה גופנית או נפשית. אתה מבין כי האחריות שלך היא לשפוט את היכולות הגופניות והנפשיות שלך עבור פעילויות כאלה.

</li>

<li>
     שיעורים – אין לאחר לשיעורים. במידה ואיחרת, רשות להכנס תינתן בתלות התנאים בשיעור הספציפי – לפי החלטת המורה. בכל מקרה לא תינתן כניסה באיחור של עשר דקות.
</li>

<li>
 נהלי הרשמה - ההרשמה מראש ודרך האתר.
</li>

<li>ביטול שיעורים- אפשר לבטל שיעורי <span className='bold'>ערב</span> עד שעתיים לפני השיעור. שיעור <span className='bold'>בוקר</span>
 {' '}ניתן לבטל עד השעה 22:00 ערב הקודם ליום השיעור. 
  במידה ולא ביטלת בזמן תחשב הכניסה במניין הכניסות השבועיות\חודשיות שלך. 
</li>
<li>פתיחת שיעור/אימון וקיומו תלויים במספר מינימלי של משתתפים .</li>
<li>הסטודיו רשאי להפסיק או לשנות את מועדי הפעילות ולהחליף מורים ומאמנים, לפי שיקול דעתה.</li>
<li>חפצים ורכוש – הסטודיו לא אחראי על חפצים אותם השאיר החבר בתחום הסטודיו.</li>
<li>כללי – החברה רשאית לסיים את חברותו של כל חבר במקרה של הפרה של איזו מהוראות התקנון או של איזו מהוראות המורים או במקרה של הפרת משמעת חמורה ו/או התנהגות גסה, פרועה או אלימה ו/או התבטאות מילולית גסה או אלימה</li>
<li>
החברה שומרת לעצמה את הזכות, לפי שיקול דעתה הבלעדי, לסרב לקבל מועמד כמנוי במועדון ו/ואו לחדש מנוי קיים.
החברה רשאית לשנות ולתקן מעת לעת ולפי שיקול דעתה את התקנון.
</li>
<li>
   החבר מאשר כי קרא והבין את התקנון המהווה חלק מהחוזה בין החברה לחבר והוא מאשר כי ניתנו לו תשובות לכל שאלותיו ונמסר לו הסבר בדבר זכותו לבטל את המנוי, האופן והעלויות הכרוכות בכך וחתימתו על טופס ההרשמה ועל התקנון מהווה הסכמה לאמור בתקנון.
 
</li>
<li>*חלקים מתקנון זה מנוסחים בלשון זכר מטעמי נוחות בלבד, אך כל האמור בתקנון מיועד לנשים וגברים כאחד.
</li>




            
        </ol>
        </section>
  )
}