'use client'
import React, { useState } from 'react'

type Props = {}

export default function Content({ }: Props) {
    const [isShown, setIsShown] = useState(false)
    return (
        <section className={!isShown?'content flex-col gap05':'flex-col gap05'}>

            {/* <p>נעים להכיר – </p> */}
            <p>אני יאיר שורץ, בן 34, אבא גאה למעיין ובן זוג למורן. מתגורר בקיבוץ משמרות, והיוגה עבורי היא הרבה יותר ממקצוע – היא דרך חיים, חיבור ושקט פנימי. </p>
            <p>את המסע שלי בעולם היוגה התחלתי בשנת 2013, מתוך חיפוש אחר איזון והרמוניה בחיי. בשנת 2015 יצאתי להודו, שם השלמתי את קורס המורים הראשון שלי בסטודיו Universal Yoga של ויגיי האמר. לאחר מכן, המשכתי את החקירה בדרום הודו, במייסור – בירת האשטנגה העולמית, שם העמקתי את הידע שלי עם מורים ותיקים ומעוררי השראה.</p>
            <p>עם חזרתי לארץ בשנת 2016, המשכתי את דרכי עם המורה שלי, יניב עוקשי, במרכז "קארמה" בראשון לציון. בנוסף, בחרתי להעמיק את ההכשרה שלי בארץ והשלמתי קורס מורים נוסף של 500 שעות אשטנגה, שהתמקד בתרגול קלאסי ובשיטות הוראה מעמיקות. </p>
            <p>במקביל ללימודיי ביוגה, פניתי גם לעולם האיורוודה, מדע הרפואה ההודית. השלמתי מסלול לימודים תלת-שנתי אצל עמי ריין בפרדס חנה, כולל סטאז' מעשי בדרום הודו, שהעשיר את הכלים שאני מביא איתי לשיעורים ולמפגשים פרטניים. </p>
            <p>בסטודיו תוכלו ללמוד ולתרגל כמה סגנונות – אשטנגה קלאסית (סדרה ראשונה ושנייה), האטה יוגה ותרגולי מייסור. עבורי, היוגה היא מקור של חיים: היא מעוררת, מחייה, מחברת אותי לגוף ולנשימה ומעניקה שקט ורוגע בתוך הקצב המהיר של היומיום.  </p>
            <p>**מזמין אתכם להצטרף אליי**  </p>
            <p>בין אם אתם בתחילת דרככם ובין אם אתם מחפשים להעמיק את התרגול שלכם, אני כאן כדי ללוות אתכם. המרחב שאני יוצר בשיעורים הוא מקום בטוח, מכיל ותומך – שבו תוכלו להקשיב לגוף, לנשום ולהרגיש.  </p>

           {!isShown&& <div className="blur-overlay flex-jc-ac">
                <p className="more pointer" onClick={()=>setIsShown(true)}> להמשך קריאה</p>
            </div>}
        </section>
    )
}